{
    "license": "Apache-2.0", 
    "title": "CWLab - An open-source framework for simplified deployment of the Common Workflow Language using a graphical web interface", 
    "description": "The Common Workflow Language (CWL) allows to wrap and link up bioinformatic software in a standardized and portable way. However, setting up and operating a CWL-based workflow management system can be a labor-intensive challenge for many data-driven laboratories. To this end, we developed CWLab: a framework for simplified, graphical deployment of CWL. CWLab allows life-science researchers with all levels of computational proficiency to create, execute and monitor jobs for CWL-wrapped tools and workflows. Input parameters for large sample batches are specified using a simple HTML form or a spreadsheet and are automatically validated. The integrated webserver allows to remotely control the execution on clusters as well as single workstations. CWLab can also be used as a local desktop application that supports Linux, MacOS, and Windows by leveraging Docker containerization. Our Python-based framework is easy to set up and, via a flexible API, it can be integrated with any CWL runner and adapted to custom software environments. With CWLab, we would like to hide the complexity of workflow management so that scientific users can focus on their data analyses. This might promote the adoption of CWL in multi-professional life-science laboratories.", 
    "creators": [
        {
            "affiliation": "German Cancer Research Center", 
            "name": "Kersten Breuer"
        },
        {
            "affiliation": "Charité Berlin", 
            "name": "Sven Twardziok"
        },
        {
            "affiliation": "Justus-Liebig-Universität Gießen", 
            "name": "Marius Dieckmann"
        },
        {
            "affiliation": "Justus-Liebig-Universität Gießen", 
            "name": "Lukas Jelonek"
        },
        {
            "affiliation": "German Cancer Research Center", 
            "name": "Yoann Pageaud"
        },
        {
            "affiliation": "German Cancer Research Center", 
            "name": "Yassen Assenov"
        },
        {
            "affiliation": "German Cancer Research Center", 
            "name": "Christoph Plass"
        },
        {
            "affiliation": "German Cancer Research Center", 
            "name": "Pavlo Lutsik"
        }
    ]
}
